In [1]:
import pandas as pd
data={'country':['india','japan','australia'],
     'capital':['delhi','tokyo','sydney']}
df=pd.DataFrame(data)
df

     country capital
0      india   delhi
1      japan   tokyo
2  australia  sydney

In [2]:
df.drop('capital',axis=1)

     country
0      india
1      japan
2  australia

In [3]:
df.append({'continent':'asia'},ignore_index=True)

     country capital continent
0      india   delhi       NaN
1      japan   tokyo       NaN
2  australia  sydney       NaN
3        NaN     NaN      asia

In [4]:
df.loc[1]

country    japan
capital    tokyo
Name: 1, dtype: object

In [5]:
df.fillna(value=0)

     country capital
0      india   delhi
1      japan   tokyo
2  australia  sydney

In [6]:
import pandas as pd
data=pd.read_csv("C:\\Users\\91888\\OneDrive\\Desktop\\covid.csv")
df=pd.DataFrame(data)
df

,location,date,variant,num_sequences,perc_sequences,num_sequences_total
0,Angola,2020-07-06,Alpha,0,0.0,3
1,Angola,2020-07-06,B.1.1.277,0,0.0,3
2,Angola,2020-07-06,B.1.1.302,0,0.0,3
3,Angola,2020-07-06,B.1.1.519,0,0.0,3
4,Angola,2020-07-06,B.1.160,0,0.0,3
...,...,...,...,...,...,...
100411,Zimbabwe,2021-11-01,Omicron,0,0.0,6
100412,Zimbabwe,2021-11-01,S:677H.Robin1,0,0.0,6
100413,Zimbabwe,2021-11-01,S:677P.Pelican,0,0.0,6
100414,Zimbabwe,2021-11-01,others,0,0.0,6
100415,Zimbabwe,2021-11-01,non_who,0,0.0,6

In [7]:
df.head()

,location,date,variant,num_sequences,perc_sequences,num_sequences_total
0,Angola,2020-07-06,Alpha,0,0.0,3
1,Angola,2020-07-06,B.1.1.277,0,0.0,3
2,Angola,2020-07-06,B.1.1.302,0,0.0,3
3,Angola,2020-07-06,B.1.1.519,0,0.0,3
4,Angola,2020-07-06,B.1.160,0,0.0,3

In [8]:
df.iloc[2]

location                   Angola
date                   2020-07-06
variant                 B.1.1.302
num_sequences                   0
perc_sequences                0.0
num_sequences_total             3
Name: 2, dtype: object

In [9]:
df.loc[2]

location                   Angola
date                   2020-07-06
variant                 B.1.1.302
num_sequences                   0
perc_sequences                0.0
num_sequences_total             3
Name: 2, dtype: object

In [10]:
import pandas as pd
df1=pd.DataFrame({'city':['newyork','chicago','ordon'],
                  'temp':[21,34,54]
})
df1

      city  temp
0  newyork    21
1  chicago    34
2    ordon    54

In [11]:
df2=pd.DataFrame({'city':['new york','chicago','ordon'],
                 'humidity':[21,34,54]})
df2

       city  humidity
0  new york        21
1   chicago        34
2     ordon        54

In [12]:
df=pd.merge(df1,df2,on="city")
df

      city  temp  humidity
0  chicago    34        34
1    ordon    54        54

In [19]:
df=pd.concat([df1,df2])
df

       city  temp  humidity
0   newyork  21.0       NaN
1   chicago  34.0       NaN
2     ordon  54.0       NaN
0  new york   NaN      21.0
1   chicago   NaN      34.0
2     ordon   NaN      54.0

In [21]:
df.fillna(0)

       city  temp  humidity
0   newyork  21.0       0.0
1   chicago  34.0       0.0
2     ordon  54.0       0.0
0  new york   0.0      21.0
1   chicago   0.0      34.0
2     ordon   0.0      54.0